// Реализуйте абстракцию (набор функций) для работы с прямоугольниками, стороны которого всегда параллельны осям.
// Прямоугольник может располагаться в любом месте координатной плоскости.
//
// При такой постановке, достаточно знать только три параметра для однозначного задания прямоугольника на плоскости: координаты левой верхней точки, ширину и высоту.
// Зная их, мы всегда можем построить прямоугольник одним единственным способом.
//
//
// Основной интерфейс:
//
//     makeRectangle(point, width, height) (конструктор) – создает прямоугольник. Принимает параметры: левую-верхнюю точку, ширину и высоту. Ширина и высота – положительные числа.
//
//     Селекторы getStartPoint(rectangle), getWidth(rectangle) и getHeight(rectangle)
//
// containsOrigin(rectangle) – проверяет, принадлежит ли центр координат прямоугольнику (не лежит на границе прямоугольника, а находится внутри).
// Чтобы в этом убедиться, достаточно проверить, что все вершины прямоугольника лежат в разных квадрантах (их можно высчитать в момент проверки).
//
// Экспортируйте функции makeRectangle(point, width, height) и containsOrigin(rectangle).
//
//     Примеры:

// Создание прямоугольника:
// p - левая верхняя точка
// 4 - ширина
// 5 - высота
//
// p    4
// -----------
// |         |
// |         | 5
// |         |
// -----------

import { makeDecartPoint, makeRectangle, containsOrigin } from "./rectangle.js";

const p = makeDecartPoint(0, 1);
const rectangle = makeRectangle(p, 4, 5);
console.log(rectangle);
console.log(containsOrigin(rectangle)); // false

const rectangle2 = makeRectangle(makeDecartPoint(-4, 3), 5, 4);
console.log(rectangle2);
console.log(containsOrigin(rectangle2)); // true

// Подсказки
// Квадрант плоскости — любая из 4 областей (углов), на которые плоскость делится двумя взаимно перпендикулярными прямыми, принятыми в качестве осей координат.